src/cf/src/Catalogs/ГрафикиРаботыСотрудников/ГрафикиРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГрафикиРаботыСотрудников</name>
  <attributes>
    <name>НачалоРабочегоДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецРабочегоДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихЧасовВРабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоЧасовВРабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихЧасовВПредпраздничныйДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоЧасовВПредпраздничныйДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентУчетаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/ГрафикиРаботыСотрудников/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НачалоРабочегоДня > КонецРабочегоДня Тогда
		
		ТекстСообщения = НСтр("ru = 'Начало рабочего дня не может быть больше конца рабочего дня.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ВсегоЧасовВРабочийДень = (КонецРабочегоДня - НачалоРабочегоДня) / 3600;
	
	Если КоличествоРабочихЧасовВРабочийДень > ВсегоЧасовВРабочийДень Тогда
		
		ТекстСообщения = НСтр("ru = 'Количество рабочих часов не может быть больше общей продолжительности рабочего дня.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
	КонецЕсли;
	
	КоличествоРабочихЧасовВПредпраздничныйДень = КоличествоРабочихЧасовВРабочийДень - 1;
	ВсегоЧасовВПредпраздничныйДень = ВсегоЧасовВРабочийДень - 1;
	
	Если ВсегоЧасовВРабочийДень = 0 Тогда
		
		КоэффициентУчетаВремени = 1;
		
	Иначе
		
		КоэффициентУчетаВремени = КоличествоРабочихЧасовВРабочийДень / ВсегоЧасовВРабочийДень;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
